In [43]:
import pandas as pd
import numpy as np

In [44]:
from pandas import Series, DataFrame

In [45]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns = ['one', 'two', 'three', 'four'])

In [46]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
# loc는 축이름, iloc 정수 색인으로 선택할 때 사용

In [53]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [41]:
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [42]:
data.iloc[[2]]

      one  two  three  four
Utah    8    9     10    11

In [54]:
data.loc[:'Utah', 'two'] #슬라이스도 지원

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [56]:
data.loc[:'Colorado', :'three']

          one  two  three
Ohio        0    1      2
Colorado    4    5      6

In [57]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14